var demoData = {
    homeData: {
        overview: {
            kpi_1: [
                ['总收入', '21,193,200', ''],
                ['完成率', '120%', ''],
                ['同比', '25%', '']
            ],
            kpi_2: [
                ['战略产品', '16,889', '台'],
                ['完成率', '88%', ''],
                ['同比', '36%', '']
            ],
            kpi_3: [
                ['毛利额', '151,000', ''],
                ['完成率', '58%', ''],
                ['同比', '18%', '']
            ],
            kpi_4: [
                ['毛利率', '58%', ''],
                ['去年同期', '88%', ''],
                ['同比', '36%', '']
            ],
            kpi_5: [
                ['扣费毛利', '281,000', ''],
                ['完成率', '58%', ''],
                ['同比', '18%', '']
            ],
            kpi_6: [
                ['扣费毛利率', '33%', ''],
                ['去年同期', '88%', ''],
                ['同比', '36%', '']
            ],
            kpi_7: [
                ['人均销售额', '58,000', '万元/人'],
                ['去年同期', '153', '万元/人'],
                ['同比', '9%', '']
            ],
            kpi_8: [
                ['人均扣费毛利', '200', '万元/人'],
                ['去年同期', '132', '万元/人'],
                ['同比', '36%', '']
            ]
        }
    },
    incomeData: {
        bp: {
            xAxisData: [
                '业务部ABC01',
                '业务部ABC02',
                '业务部ABC03',
                '业务部ABC04',
                '业务部ABC05',
                '业务部ABC06',
                '业务部ABC07',
                '业务部ABC08',
                '业务部ABC09',
                '业务部ABC10',
                '业务部ABC12',
                '业务部ABC13'
            ],
            seriesData1: [120, 110, 100, 90, 80, 70, 60, 50, 40, 30, 20, 10],
            seriesData2: [110, 100, 90, 80, 70, 60, 50, 40, 30, 20, 10, 5],
            seriesData3: [20, 30, 40, 30, -20, 20, 15, 30, 20, 10, 25, 20]
        },
        bpDrillDown: {
            业务部ABC10: {
                xAxisData: [
                    '产品线ABC01',
                    '产品线ABC02',
                    '产品线ABC03',
                    '产品线ABC04',
                    '产品线ABC05',
                    '产品线ABC06',
                    '产品线ABC07',
                    '产品线ABC08',
                    '产品线ABC09',
                    '产品线ABC10',
                    '产品线ABC12',
                    '产品线ABC13'
                ],
                seriesData1: [120, 110, 100, 90, 80, 70, 60, 50, 40, 30, 20, 10],
                seriesData2: [110, 100, 90, 80, 70, 60, 50, 40, 30, 20, 10, 5],
                seriesData3: [20, 30, 40, 30, -20, 20, 15, 30, 20, 10, 25, 20]
            },
            业务部ABC09: {
                xAxisData: [
                    '产品线ABC01',
                    '产品线ABC02',
                    '产品线ABC03',
                    '产品线ABC04',
                    '产品线ABC05',
                    '产品线ABC06',
                    '产品线ABC07',
                    '产品线ABC08',
                    '产品线ABC09',
                    '产品线ABC10',
                    '产品线ABC12',
                    '产品线ABC13'
                ],
                seriesData1: [120, 110, 100, 90, 80, 70, 60, 50, 40, 30, 20, 10],
                seriesData2: [110, 100, 90, 80, 70, 60, 50, 40, 30, 20, 10, 5],
                seriesData3: [20, 30, 40, 30, -20, 20, 15, 30, 20, 10, 25, 20]
            }

        },
        structure: [
            {
                bar: {
                    text: '业务部总体行业同比',
                    xAxis: [
                        '行业XXXA',
                        '行业XXXB',
                        '行业XXXC',
                        '行业XXXD',
                        '行业XXXE',
                        '行业XXXF',
                        '行业XXXG',
                        '行业XXXC',
                        '行业XXXD',
                        '行业XXXE',
                        '行业XXXF',
                        '行业XXXG'
                    ],
                    series: [90, 100, 80, 80, 70, 68, 95, 80, 80, 70, 68, 95],
                    avg: [30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]
                }
            },
            {
                bar: {
                    text: '业务部总体行业同比',
                    xAxis: [
                        '行业XXXA',
                        '行业XXXB',
                        '行业XXXC',
                        '行业XXXD',
                        '行业XXXE',
                        '行业XXXF',
                        '行业XXXG',
                        '行业XXXC',
                        '行业XXXD',
                        '行业XXXE',
                        '行业XXXF',
                        '行业XXXG'
                    ],
                    series: [100, 80, 79, 50, 70, 68, 100, 80, 80, 70, 68, 95],
                    avg: [50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]
                }
            },
            {
                pie: [
                    { value: 335, name: '直接访问' },
                    { value: 310, name: '邮件营销' },
                    { value: 234, name: '联盟广告' },
                    { value: 135, name: '视频广告' },
                    { value: 1548, name: '搜索引擎' }
                ],
                text: '业务部总体占比'

            }
        ],

    }

}

export default demoData;