var planData1 = [
    {
        name: "三亚华鑫科技",
        type: "客户关系维护",
        title: "三亚华鑫科技",
        data: "2019/03/18",
        subData: [
            ['客户1','拜访','2019/02/01','霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发'],
            ['客户1','拜访','2019/02/01','霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发'],
            ['客户1','拜访','2019/02/01','霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发'],
            ['客户1','拜访','2019/02/01','霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发'],
            ['客户1','拜访','2019/02/01','霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发'],
            ['客户1','拜访','2019/02/01','霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发'],
            ['客户1','拜访','2019/02/01','霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发霸道爱看的就是发']
        ]
    },
    {
        name: "三亚华鑫科技",
        type: "客户关系维护",
        title: "三亚华鑫科技",
        data: "2019/03/18",
        subData: [1,2,3,4,5,6,7,8,9,10]
    },{
        name: "三亚华鑫科技",
        type: "客户关系维护",
        title: "三亚华鑫科技",
        data: "2019/03/18",
        subData: [1,2,3,4,5,6,7,8,9,10]
    }
];

var planData2 = [
    {
        name: "三亚华鑫科",
        type: "客户关系维护",
        title: "三亚华鑫科",
        data: "2019/03/11",
        subData: [
            {
                subTitle: "a",
                context:
                    "7.2跟进商机(**商机名称)"
            }
        ]
    },
    {
        name: "上海像我信息科",
        type: "客户关系维护",
        title: "上海像我信息科",
        data: "2019/03/11",
        subData: [
            {
                subTitle: "b",
                context:
                    "交警车载项目，广场客流项目交流"
            }
        ]
    },
    {
        name: "上海吉运软件技能",
        type: "交易活动",
        title: "上海吉运软件技能",
        data: "2019/03/11",
        subData: [
            {
                subTitle: "c",
                context:
                    "拜访客户"
            }
        ]
    },
    {
        name: "上海嘉天信息",
        type: "客户关系提升",
        title: "上海嘉天信",
        data: "2019/03/11",
        subData: [
            {
                subTitle: "d",
                context:
                    "传递**(公司/行业/产品)信息，挖掘到合作机会点"
            }
        ]
    },
    {
        name: "三亚华鑫科",
        type: "客户关系维护",
        title: "三亚华鑫科",
        data: "2019/03/11",
        subData: [
            {
                subTitle: "a",
                context:
                    "7.2跟进商机(**商机名称)"
            }
        ]
    },
    {
        name: "上海像我信息",
        type: "客户关系维护",
        title: "上海像我信息",
        data: "2019/03/11",
        subData: [
            {
                subTitle: "b",
                context:
                    "交警车载项目，广场客流项目交流"
            }
        ]
    },
    {
        name: "上海吉运软件",
        type: "交易活动",
        title: "上海吉运软件",
        data: "2019/03/11",
        subData: [
            {
                subTitle: "c",
                context:
                    "拜访客户"
            }
        ]
    },
    {
        name: "上海嘉天信息",
        type: "客户关系提升",
        title: "上海嘉天信息",
        data: "2019/03/11",
        subData: [
            {
                subTitle: "d",
                context:
                    "传递**(公司/行业/产品)信息，挖掘到合作机会点"
            }
        ]
    },
    {
        name: "三亚华鑫科",
        type: "客户关系维护",
        title: "三亚华鑫科",
        data: "2019/03/11",
        subData: [
            {
                subTitle: "a",
                context:
                    "7.2跟进商机(**商机名称)"
            }
        ]
    },
    {
        name: "上海像我信息",
        type: "客户关系维护",
        title: "上海像我信息",
        data: "2019/03/11",
        subData: [
            {
                subTitle: "b",
                context:
                    "交警车载项目，广场客流项目交流"
            }
        ]
    },
    {
        name: "上海吉运软件",
        type: "交易活动",
        title: "上海吉运软件",
        data: "2019/03/11",
        subData: [
            {
                subTitle: "c",
                context:
                    "拜访客户"
            }
        ]
    },
    {
        name: "上海嘉天信息",
        type: "客户关系提升",
        title: "上海嘉天信息",
        data: "2019/03/11",
        subData: [
            {
                subTitle: "d",
                context:
                    "传递**(公司/行业/产品)信息，挖掘到合作机会点"
            }
        ]
    },
    {
        name: "三亚华鑫科",
        type: "客户关系维护",
        title: "三亚华鑫科",
        data: "2019/03/11",
        subData: [
            {
                subTitle: "a",
                context:
                    "7.2跟进商机(**商机名称)"
            }
        ]
    },
    {
        name: "上海像我信息",
        type: "客户关系维护",
        title: "上海像我信息",
        data: "2019/03/11",
        subData: [
            {
                subTitle: "b",
                context:
                    "交警车载项目，广场客流项目交流"
            }
        ]
    },
    {
        name: "上海吉运软件",
        type: "交易活动",
        title: "上海吉运软件",
        data: "2019/03/11",
        subData: [
            {
                subTitle: "c",
                context:
                    "拜访客户"
            }
        ]
    },
    {
        name: "上海嘉天信息技术有限公司",
        type: "客户关系提升",
        title: "上海嘉天信息技术有限公司",
        data: "2019/03/11",
        subData: [
            {
                subTitle: "d",
                context:
                    "传递**(公司/行业/产品)信息，挖掘到合作机会点"
            }
        ]
    }
];


var orgData = [
    {
        name: "北京分公司",
        title: "北京分公司",
        data: ['60', '34%', '12%'],
        subData: []
    },
    {
        name: "兰州分公司",
        title: "兰州分公司",
        data: ['50', '34%', '12%'],
        subData: [
            {
                subTitle: "临夏区域组",
                data: ['50', '34%', '12%']
            },
            {
                subTitle: "企事业销售部",
                data: ['20', '74%', '22%']
            },
            {
                subTitle: "公共服务销售部",
                data: ['30', '44%', '32%']
            },
            {
                subTitle: "天水区域组",
                data: ['20', '74%', '22%']
            },
            {
                subTitle: "客户销售部",
                data: ['20', '74%', '22%']
            },
            {
                subTitle: "庆阳区域组",
                data: ['20', '74%', '22%']
            }
        ]
    },
    {
        name: "南京分公司",
        title: "南京分公司",
        data: ['50', '34%', '12%'],
        subData: [
            
        ]
    }
];


export { planData1, planData2, orgData }